; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-3nodes-1000size-4degree-100mindistance-4trucks-4packages-412seed

(define (problem transport-two-cities-sequential-3nodes-1000size-4degree-100mindistance-4trucks-4packages-412seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 305,196 -> 202,117
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 13)
  ; 202,117 -> 305,196
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 13)
  ; 578,200 -> 202,117
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 39)
  ; 202,117 -> 578,200
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 39)
  ; 578,200 -> 305,196
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 28)
  ; 305,196 -> 578,200
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 28)
  ; 2001,73 -> 2479,488
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 64)
  ; 2479,488 -> 2001,73
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 64)
  ; 2614,714 -> 2479,488
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 27)
  ; 2479,488 -> 2614,714
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 27)
  ; 578,200 <-> 2001,73
  (road city-1-loc-3 city-2-loc-2)
  (= (road-length city-1-loc-3 city-2-loc-2) 143)
  (road city-2-loc-2 city-1-loc-3)
  (= (road-length city-2-loc-2 city-1-loc-3) 143)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-2)
  (at package-3 city-1-loc-3)
  (at package-4 city-1-loc-2)
  (at truck-1 city-2-loc-3)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-3)
  (at truck-3 city-2-loc-3)
  (capacity truck-3 capacity-3)
  (at truck-4 city-2-loc-2)
  (capacity truck-4 capacity-3)
 )
 (:goal (and
  (at package-1 city-2-loc-2)
  (at package-2 city-2-loc-3)
  (at package-3 city-2-loc-3)
  (at package-4 city-2-loc-1)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-2 city-1-loc-3)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 4
2. (drive truck-2 city-1-loc-3 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 4
3. (pick-up truck-2 city-1-loc-2 package-4 capacity-2 capacity-3)
   deleted: (at package-4 city-1-loc-2) (capacity truck-2 capacity-3)
   added: (in package-4 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 4
4. (pick-up truck-2 city-1-loc-2 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-2) (capacity truck-2 capacity-2)
   added: (in package-2 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 4
5. (drive truck-2 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-1-loc-1)
   goals met: 0 of 4
6. (pick-up truck-2 city-1-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-1) (capacity truck-2 capacity-1)
   added: (in package-1 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 4
7. (drive truck-2 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 4
8. (drive truck-2 city-1-loc-3 city-2-loc-2)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-2-loc-2)
   goals met: 0 of 4
9. (drop truck-2 city-2-loc-2 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-0)
   added: (at package-1 city-2-loc-2) (capacity truck-2 capacity-1)
   goals met: 1 of 4
10. (drive truck-2 city-2-loc-2 city-1-loc-3)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-1-loc-3)
   goals met: 1 of 4
11. (pick-up truck-2 city-1-loc-3 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-1-loc-3) (capacity truck-2 capacity-1)
   added: (in package-3 truck-2) (capacity truck-2 capacity-0)
   goals met: 1 of 4
12. (drive truck-2 city-1-loc-3 city-2-loc-2)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-2-loc-2)
   goals met: 1 of 4
13. (drive truck-2 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-1)
   goals met: 1 of 4
14. (drop truck-2 city-2-loc-1 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-0)
   added: (at package-4 city-2-loc-1) (capacity truck-2 capacity-1)
   goals met: 2 of 4
15. (drive truck-2 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-3)
   goals met: 2 of 4
16. (drop truck-2 city-2-loc-3 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-1)
   added: (at package-2 city-2-loc-3) (capacity truck-2 capacity-2)
   goals met: 3 of 4
17. (drop truck-2 city-2-loc-3 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-2)
   added: (at package-3 city-2-loc-3) (capacity truck-2 capacity-3)
   goals met: 4 of 4
